Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetModifiedObjects Method
Note: This API is now obsolete.
 Gets a list of the objects that have been added or modified after the modification stamp.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use TakeModifications() instead.")]
public static ModelObjectEnumerator GetModifiedObjects(
	ModificationStamp ModStamp
)
<ObsoleteAttribute("Use TakeModifications() instead.")>
Public Shared Function GetModifiedObjects (
	ModStamp As ModificationStamp
) As ModelObjectEnumerator
Parameters
ModStamp
Type: Tekla.Structures.Model.History.ModificationStamp
The modification stamp.
Return Value
Type: ModelObjectEnumerator
A list of the objects that have been modified after the given modification stamp.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace